---
kind: type
id: T:Autodesk.Revit.DB.ScheduleVerticalAlignment
source: html/62344232-f3c8-d73c-ae1d-3ed545a54b9c.htm
---
# Autodesk.Revit.DB.ScheduleVerticalAlignment

Vertical alignment of data in a schedule.

## Syntax (C#)
```csharp
public enum ScheduleVerticalAlignment
```